import type { SkillGroupName } from '../../types/COCMetaData/skillGroup';

export const skillGroups: Record<SkillGroupName, string[]> = {
  特殊: ['信用评级', '克苏鲁神话'],
  探索: [
    '侦查',
    '聆听',
    '图书馆使用',
    '计算机使用Ω',
    '潜行',
    '追踪',
    '乔装',
    '估价',
    // '读唇',
  ],
  社交: ['取悦', '话术', '恐吓', '说服', '心理学', '母语', '外语'],
  战斗: [
    '闪避',
    '格斗',
    '射击',
    '投掷',
    // '爆破',
    // '炮术',
  ],
  医疗: [
    '急救',
    '医学',
    '精神分析',
    // '催眠',
  ],
  运动: [
    '攀爬',
    '跳跃',
    '游泳',
    // '潜水',
  ],
  知识: ['博物学', '神秘学', '考古学', '人类学', '会计', '法律', '历史', '电子学Ω', '科学'],
  技术: ['妙手', '锁匠', '电气维修', '机械维修', '导航', '驯兽', '技艺', '生存'],
  操纵: ['操作重型机械', '汽车驾驶', '驾驶', '骑术'],
  其它: [''],
};

export const skillGroupOrder = [
  '特殊',
  '探索',
  '社交',
  '战斗',
  '医疗',
  '运动',
  '知识',
  '技术',
  '操纵',
  '其它',
];
