// 英文名数据源，包括姓氏、男性名、女性名
export const namesEnSources = {
  lastNames: [
    ['史密斯', 'Smith'],
    ['约翰逊', 'Johnson'],
    ['威廉姆斯', 'Williams'],
    ['布朗', 'Brown'],
    ['琼斯', 'Jones'],
    ['米勒', 'Miller'],
    ['戴维斯', 'Davis'],
    ['加西亚', 'Garcia'],
    ['罗德里格斯', 'Rodriguez'],
    ['威尔逊', 'Wilson'],
    ['安德森', 'Anderson'],
    ['赫南德斯', 'Hernandez'],
    ['摩尔', 'Moore'],
    ['马丁内斯', 'Martinez'],
    ['泰勒', 'Taylor'],
    ['马丁', 'Martin'],
    ['李', 'Lee'],
    ['佩雷斯', 'Perez'],
    ['汤普森', 'Thompson'],
    ['白', 'White'],
    ['洛佩兹', 'Lopez'],
    ['罗宾逊', 'Robinson'],
    ['克拉克', 'Clark'],
    ['刘易斯', 'Lewis'],
    ['沃克', 'Walker'],
    ['霍尔', 'Hall'],
    ['杨', 'Young'],
    ['桑切斯', 'Sanchez'],
    ['王', 'Wang'],
    ['斯科特', 'Scott'],
    ['格林', 'Green'],
    ['亚当斯', 'Adams'],
    ['贝利', 'Bailey'],
    ['贝尔', 'Bell'],
    ['考克斯', 'Cox'],
    ['沃德', 'Ward'],
    ['卡特', 'Carter'],
    ['巴恩斯', 'Barnes'],
    ['罗杰斯', 'Rogers'],
    ['里德', 'Reed'],
    ['库克', 'Cook'],
    ['摩根', 'Morgan'],
    ['彼得森', 'Peterson'],
    ['科林斯', 'Collins'],
    ['爱德华兹', 'Edwards'],
    ['弗洛雷斯', 'Flores'],
    ['莫里斯', 'Morris'],
    ['冈萨雷斯', 'Gonzalez'],
    ['纳尔逊', 'Nelson'],
    ['穆雷', 'Murray'],
    ['佩里', 'Perry'],
    ['鲍威尔', 'Powell'],
    ['罗素', 'Russell'],
    ['沃森', 'Watson'],
    ['索托', 'Soto'],
    ['亨德森', 'Henderson'],
    ['斯宾塞', 'Spencer'],
    ['奥尔蒂斯', 'Ortiz'],
    ['卡斯特罗', 'Castro'],
    ['帕特森', 'Patterson'],
    ['哈里斯', 'Harris'],
    ['桑德斯', 'Sanders'],
    ['哈里森', 'Harrison'],
    ['格雷厄姆', 'Graham'],
    ['弗格森', 'Ferguson'],
    ['拉米雷斯', 'Ramirez'],
    ['韦伯', 'Webb'],
    ['奥尔森', 'Olson'],
    ['斯图尔特', 'Stewart'],
    ['华盛顿', 'Washington'],
    ['威尔斯', 'Wells'],
    ['巴特勒', 'Butler'],
    ['辛普森', 'Simpson'],
    ['雷诺兹', 'Reynolds'],
    ['费雪', 'Fisher'],
    ['亚历山大', 'Alexander'],
    ['布莱克', 'Black'],
    ['霍夫曼', 'Hoffman'],
    ['阿尔瓦雷斯', 'Alvarez'],
    ['格雷', 'Gray'],
    ['詹金斯', 'Jenkins'],
    ['菲利普斯', 'Phillips'],
    ['埃文斯', 'Evans'],
    ['科尔曼', 'Coleman'],
    ['钱德勒', 'Chandler'],
    ['康纳', 'Connor'],
  ],
  maleNames: [
    ['詹姆斯', 'James'],
    ['约翰', 'John'],
    ['罗伯特', 'Robert'],
    ['约瑟夫', 'Joseph'],
    ['乔治', 'George'],
    ['查尔斯', 'Charles'],
    ['弗兰克', 'Frank'],
    ['爱德华', 'Edward'],
    ['亨利', 'Henry'],
    ['托马斯', 'Thomas'],
    ['威廉', 'William'],
    ['弗雷德', 'Fred'],
    ['哈罗德', 'Harold'],
    ['艾尔伯特', 'Albert'],
    ['路易斯', 'Louis'],
    ['杰克', 'Jack'],
    ['克拉伦斯', 'Clarence'],
    ['阿瑟', 'Arthur'],
    ['雷蒙德', 'Raymond'],
    ['卡尔', 'Carl'],
    ['乔', 'Joe'],
    ['理查德', 'Richard'],
    ['赫伯特', 'Herbert'],
    ['塞缪尔', 'Samuel'],
    ['罗伊', 'Roy'],
    ['哈里', 'Harry'],
    ['韦恩', 'Wayne'],
    ['埃迪', 'Eddie'],
    ['唐纳德', 'Donald'],
    ['沃尔特', 'Walter'],
    ['维克多', 'Victor'],
    ['威廉姆', 'Willie'],
    ['伯纳德', 'Bernard'],
    ['朱利叶斯', 'Julius'],
    ['诺曼', 'Norman'],
    ['欧文', 'Owen'],
    ['马文', 'Marvin'],
    ['梅尔文', 'Melvin'],
    ['迈克尔', 'Michael'],
    ['阿尔弗雷德', 'Alfred'],
    ['卢瑟', 'Luther'],
    ['霍华德', 'Howard'],
    ['莱昂纳德', 'Leonard'],
    ['菲利普', 'Philip'],
    ['拉尔夫', 'Ralph'],
    ['马库斯', 'Marcus'],
    ['莱斯特', 'Lester'],
    ['艾伦', 'Allen'],
    ['弗洛伊德', 'Floyd'],
    ['莱昂', 'Leon'],
    ['哈维', 'Harvey'],
    ['米尔顿', 'Milton'],
    ['克莱德', 'Clyde'],
    ['厄尔', 'Earl'],
    ['格伦', 'Glenn'],
    ['维恩', 'Vern'],
    ['阿伦', 'Alvin'],
    ['珀西', 'Percy'],
    ['弗农', 'Vernon'],
    ['罗斯', 'Ross'],
    ['埃米尔', 'Emil'],
    ['奥托', 'Otto'],
    ['杰西', 'Jessie'],
    ['马修', 'Matthew'],
    ['吉恩', 'Gene'],
    ['埃德温', 'Edwin'],
    ['莫里斯', 'Maurice'],
    ['威尔伯', 'Wilbur'],
    ['比尔', 'Bill'],
    ['奥维尔', 'Orville'],
    ['阿诺德', 'Arnold'],
    ['莱斯利', 'Leslie'],
    ['厄尔文', 'Irving'],
    ['威尔弗雷德', 'Wilfred'],
    ['纳撒尼尔', 'Nathaniel'],
    ['斯特林', 'Sterling'],
    ['罗兰', 'Roland'],
    ['埃尔默', 'Elmer'],
    ['汤姆', 'Tom'],
    ['欧内斯特', 'Ernest'],
    ['卢卡斯', 'Lucas'],
    ['鲍勃', 'Bob'],
    ['诺亚', 'Noah'],
    ['阿贝尔', 'Abel'],
    ['卡梅伦', 'Cameron'],
    ['布鲁斯', 'Bruce'],
    ['卡洛斯', 'Carlos'],
    ['克里斯', 'Chris'],
    ['科林', 'Colin'],
    ['达里尔', 'Daryl'],
    ['德怀特', 'Dwight'],
    ['埃利奥特', 'Elliott'],
    ['埃里克', 'Eric'],
    ['弗朗西斯', 'Francis'],
    ['加里', 'Gary'],
    ['格雷格', 'Greg'],
    ['伊桑', 'Ethan'],
    ['杰里米', 'Jeremy'],
  ],
  femaleNames: [
    ['玛丽', 'Mary'],
    ['伊丽莎白', 'Elizabeth'],
    ['露丝', 'Ruth'],
    ['玛格丽特', 'Margaret'],
    ['多萝西', 'Dorothy'],
    ['艾琳', 'Eileen'],
    ['汉娜', 'Hannah'],
    ['艾玛', 'Emma'],
    ['弗洛伦斯', 'Florence'],
    ['格蕾丝', 'Grace'],
    ['埃塞尔', 'Ethel'],
    ['露易丝', 'Louise'],
    ['贝蒂', 'Betty'],
    ['爱丽丝', 'Alice'],
    ['艾达', 'Ada'],
    ['梅布尔', 'Mabel'],
    ['艾米莉', 'Emily'],
    ['露西', 'Lucy'],
    ['埃德娜', 'Edna'],
    ['罗丝', 'Rose'],
    ['珍妮', 'Jenny'],
    ['朱莉娅', 'Julia'],
    ['卡罗琳', 'Caroline'],
    ['艾米', 'Amy'],
    ['艾琳', 'Irene'],
    ['约瑟芬', 'Josephine'],
    ['玛莎', 'Martha'],
    ['苏珊', 'Susan'],
    ['贝拉', 'Bella'],
    ['伊莎贝尔', 'Isabel'],
    ['玛格丽塔', 'Margarita'],
    ['米尔德里德', 'Mildred'],
    ['露西尔', 'Lucille'],
    ['埃斯特尔', 'Esther'],
    ['凯瑟琳', 'Catherine'],
    ['维奥拉', 'Viola'],
    ['伊娃', 'Eva'],
    ['诺拉', 'Nora'],
    ['莉莉安', 'Lillian'],
    ['玛丽安', 'Marian'],
    ['詹妮特', 'Janet'],
    ['玛吉', 'Maggie'],
    ['康斯坦丝', 'Constance'],
    ['珍', 'Jean'],
    ['埃莉诺', 'Elinor'],
    ['梅', 'Mae'],
    ['埃塞尔琳', 'Ethelyn'],
    ['埃尔西', 'Elsie'],
    ['埃塔', 'Etta'],
    ['欧金妮亚', 'Eugenia'],
    ['伊芙琳', 'Evelyn'],
    ['伊芙', 'Eve'],
    ['伊冯娜', 'Evonne'],
    ['费丝', 'Faith'],
    ['芬妮', 'Fanny'],
    ['费伊', 'Fay'],
    ['费叶', 'Faye'],
    ['费利西亚', 'Felicia'],
    ['费恩', 'Fern'],
    ['弗洛拉', 'Flora'],
    ['弗朗希思', 'Frances'],
    ['弗雷达', 'Freda'],
    ['弗里达', 'Frieda'],
    ['加布里埃尔', 'Gabrielle'],
    ['盖尔', 'Gail'],
    ['格特鲁德', 'Gertrude'],
    ['格拉迪斯', 'Gladys'],
    ['格温多琳', 'Gwendolyn'],
    ['海泽尔', 'Hazel'],
    ['海伦娜', 'Helena'],
    ['希尔达', 'Hilda'],
    ['胡尔达', 'Hulda'],
    ['艾达', 'Ida'],
    ['伊拉', 'Ila'],
    ['伊琳', 'Ilene'],
    ['伊莫金', 'Imogene'],
    ['伊内兹', 'Inez'],
    ['伊尔玛', 'Irma'],
    ['艾娃', 'Iva'],
    ['艾薇', 'Ivy'],
    ['贾尼斯', 'Janice'],
    ['珍妮特', 'Jeanette'],
    ['洁茜', 'Jessie'],
    ['琼', 'Joan'],
    ['朱恩', 'June'],
    ['凯特', 'Kate'],
    ['莱拉', 'Lela'],
    ['莉娜', 'Lena'],
    ['米妮', 'Minnie'],
  ],
};

// 中文名数据源，包括姓氏、男性名（单字和双字）、女性名（单字和双字）、一些固定组合名
export const namesZhSources = {
  // 6 行常见姓 + 2 行比较好听的姓
  lastNames: str2arr(
    `
    张 王 李 赵 刘 孙 朱 秦 何 吕 许 周 吴 郑 钱 冯 陈 孔 金 魏 陶 姜 沈 韩 苏
    尹 丁 江 宋 孟 章 潘 马 苗 方 俞 任 袁 唐 费 薛 贺 余 顾 史 韦 熊 纪 舒 董
    梁 穆 萧 毛 夏 田 樊 胡 杜 阮 季 贾 林 罗 毕 郝 常 傅 曹 严 谢 杨 葛 范 黄
    姚 祁 庞 戴 梅 徐 邱 高 蔡 霍 虞 卢 莫 房 解 邓 包 石 崔 龚 程 邢 裴 陆 荣
    景 宁 伊 胥 卓 莘 闻 翟 谭 牛 燕 温 庄 晏 柴 瞿 阎 慕 习 古 易 廖 庾 步 施
    耿 满 师 巩 辛 红 游 曾 沙 车 兆 苟 仁 钟 世 肖 斐 丘 佟 言 迟 覃 楚 蒋 詹
    米 贝 尤 花 蓝 路 娄 童 时 奚 万 柯 单 左 符 白 怀 艾 鱼 容 向 简 冷 苍 双
    阳 龙 壬 友 九 寻 书 本 寒 千 诗 阿 星 南 天 风 英 兰 门 希 琴 光 文 叶 卫
    战 褚 华 戚 邹 喻 柏 水 窦 云 彭 郎 鲁 昌 凤 柳 酆 鲍 廉 岑 雷 倪 汤 谈 茅
    滕 殷 邬 安 乐 于 皮 卞 齐 康 伍 元 卜 平 和 邵 湛 汪 禹 狄 明 臧 计 伏 成
    屈 项 祝 闵 席 麻 强 危 颜 郭 盛 刁 锺 骆 凌 支 昝 管 仇 栾 暴 甘 钭 历 戎
    经 裘 缪 干 应 宗 宣 贲 郁 杭 洪 诸 吉 钮 祖 武 束 幸 司 韶 郜 黎 蓟 溥 印
    嵇 滑 翁 荀 羊 於 惠 甄 麴 家 封 芮 羿 储 靳 汲 邴 糜 松 党 贡 劳 逄 姬 从
    井 段 富 巫 乌 焦 巴 弓 牧 隗 山 谷 侯 宓 蓬 全 郗 班 仰 秋 仲 宫 毋 乜 养
    宿 蒲 邰 鄂 索 咸 籍 赖 蔺 屠 蒙 池 乔 郁 能 鞠 须 丰 巢 关 蒯 相 查 后 荆
    申 扶 堵 冉 宰 郦 雍 却 璩 桑 桂 濮 寿 通 竺 权 逮 盍 益 桓 公 寸 贰 皇 侨
    边 扈 冀 僪 浦 尚 农 别 充 连 茹 宦 彤 竭 端 赫 实 甫 集 象 翠 狂 辟 中 夕
    慎 戈 终 暨 居 衡 都 弘 匡 国 寇 广 禄 阙 东 典 良 函 芒 苦 其 京 丛 岳 召
    欧 殳 沃 利 蔚 越 夔 隆 厍 聂 晁 勾 敖 融 訾 阚 那 饶 空 有 舜 之 冠 宾 香
    果 蹇 称 诺 来 多 繁 戊 朴 回 毓 税 荤 靖 绪 愈 硕 牢 买 但 巧 枚 撒 泰 秘
    亥 绍 以 森 斋 释 奕 姒 朋 求 羽 用 占 真 穰 翦 闾 漆 贵 代 贯 旁 崇 栋 告
    万俟 司马 上官 欧阳 夏侯 诸葛 闻人 东方 赫连 皇甫 尉迟 公羊 宇文 长孙 慕容
    澹台 公冶 宗政 濮阳 淳于 单于 太叔 申屠 公孙 仲孙 轩辕 令狐 司徒 司空 太史
    钟离 乌雅 范姜 碧鲁 张廖 张简 图门 公叔 乌孙 完颜 马佳 佟佳 富察 费莫 章佳
    南宫 百里 西门 东门 乐正 漆雕 公西 巫马 端木 第五 呼延 南门
    那拉 依尔根觉罗 依尔觉罗 萨嘛喇 赫舍里 额尔德特 叶赫那拉 纳喇 索绰络
    萨克达 钮祜禄 他塔喇 喜塔腊 讷殷富察 叶赫那兰 库雅喇 瓜尔佳 舒穆禄 爱新觉罗
    休 褒 谏 锐 皋 闳 在 歧 禾 示 是 委 钊 频 嬴 呼 大 威 昂 律 开 操 瑞 眭 泥
    冒 保 系 抄 定 化 莱 校 么 抗 祢 綦 悟 宏 功 庚 务 敏 捷 拱 丑 丙 畅 运 摩
    随 类 卯 俟 答 乙 允 甲 留 尾 佼 玄 乘 裔 延 植 环 矫 赛 昔 侍 度 伟 铁 迮
    旷 遇 偶 前 由 咎 塞 敛 受 泷 袭 衅 叔 圣 御 夫 仆 镇 藩 邸 府 掌 首 员 督
    焉 戏 可 智 尔 凭 悉 进 笃 厚 业 肇 资 合 仍 衷 哀 刑 俎 仵 圭 夷 钦 鄢 汝
    徭 蛮 汗 孛 乾 帖 罕 洛 淦 洋 邶 郸 郯 邗 邛 剑 虢 隋 蒿 茆 菅 苌 树 桐 仉
    锁 机 盘 铎 斛 玉 线 针 箕 庹 绳 磨 蒉 瓮 弭 刀 疏 牵 浑 恽 势 仝 法 闫 晋
    同 蚁 止 戢 睢 冼 种 涂 己 泣 潜 卷 脱 谬 蹉 赧 浮 顿 说 次 错 念 夙 海 归
    斯 完 丹 表 聊 源 姓 吾 展 出 不 户 闭 才 无 学 愚 性 雪 霜 烟 盖 逯 库 福
    少 字 桥 板 独 嘉 扬 善 揭 祈 析 赤 紫 青 柔 刚 奇 拜 佛 陀 郏 逢 阴 薄 厉
    弥 素 长 僧 隐 仙 隽 宇 祭 酒 淡 塔 琦 闪 始 接 波 碧 速 禚 后 况 亢 缑 帅
    腾 潮 镜 似 澄 潭 謇 纵 渠 奈 春 濯 沐 茂 檀 藤 枝 检 生 折 登 赏 伯 佴 佘
    驹 骑 貊 虎 肥 鹿 雀 野 禽 飞 节 宜 鲜 粟 栗 豆 帛 官 布 衣 藏 宝 钞 银 稽
    盈 庆 喜 及 普 建 营 巨 望 道 载 声 漫 犁 力 贸 勤 革 改 兴 亓 睦 曲 竹 百
    修 信 闽 北 守 坚 勇 汉 练 尉 士 旅 五 令 将 旗 军 行 奉 敬 恭 仪 母 堂 年
    义 礼 慈 孝 理 伦 卿 问 永 辉 位 让 尧 依 犹 介 承 市 所 苑 杞 剧 第 牟 商
    零 谌 招 续 达 忻 六 鄞 候 宛 励 粘 萨 邝 辜 初 楼 城 区 局 台 纳 泉 老 清
    原 考 妫 德 卑 过 麦 爱 笪 谯 哈 墨 左丘 梁丘 微生 羊舌 东郭 谷梁 宰父 夹谷
    拓跋 壤驷 颛孙 子车 司寇 亓官 鲜于 闾丘 公良 段干
  `,
  ).sort((a, b) => a.length - b.length),
  maleNames1: str2arr(`
    东 丰 乐 亮 仁 仔 仰 仲 伟 佳 俊 信 光 刚 勇 华 博 友 坚 奇
    威 学 宇 宏 岩 峰 帅 强 彪 德 志 敏 斌 昂 昊 昌 明 晋 智 朋
    杰 松 林 柏 栋 森 正 永 波 泽 洋 浩 涛 瀚 琪 瑜 瑞 睿 石 磊
    祥 程 立 翔 联 聪 育 航 荣 虎 诚 豪 轩 辉 辰 远 雄 雷 飞 骏
    鸿 鹏 龙 三 四 五 六 八 百 万 京 令 文 尧 建 哲 阳 逸 柯 卓
  `),
  maleNames2: str2arr(`
    晓峰 俊豪 志伟 明轩 天宇 建国 永强 昊天 凯文 子健 晨曦 文博 英杰 伟峰 俊杰
    家豪 浩然 祥瑞 旭东 宇航 明杰 杰森 彬彬 杰华 俊宇 光辉 子豪 伟杰 世杰 嘉豪
    博文 明辉 君豪 宇峰 志辉 俊峰 俊熙 伟豪 君杰 宇杰 文杰 昊宇 志宇 浩杰 旭杰
    浩轩 俊辉 志豪 明宇 伟强 博豪 俊文 俊泽 凯杰 明哲 文轩 君伟 明浩 宇豪 杰宇
    俊霖 宇浩 嘉伟 子杰 子轩 嘉轩 俊轩 浩宇 俊浩 明豪 勇军 伟民 振华 国华 志刚
    建明 军伟 强生 伟东 杰雄 勇辉 光明 煜洋 雨泽 越泽 之玉 锦程 修杰 烨伟 志泽
    立辉 致远 天思 源智 烨华 振家 越彬 伟宸 晋鹏 觅松 海亦 苑博 南松 凝海 俊驰
    乐驹 风华 睿渊 博超 天磊 夜白 初晴 瑾瑜 鹏飞 弘文 伟泽 迎松 白易 远航 晓啸
    智宸 晓博 靖琪 十八 君浩 绍辉 天德 半山 一江 皓轩 子默 青寒 问筠 旭尧 冷之
    正豪 子骞 灵竹 三德 连虎 十三 天川 一德 严青 擎苍 思远 嘉懿 鸿煊 晟睿 鸿涛
    孤风 青文 若风 广山 若之 浩阑 南风 博涛 烨霖 天佑 半雪 鹏煊 沛山 道天 千筹
    远望 乘风 道之 乘云 天抒 士萧 文龙 一鸣 雨辰 远锋 元正 断秋 远山 飞扬 一笑
    天问 浩天 沧海 安康 安平 安然 安晏 安宜 安志 波鸿 博明 博雅 博易 博远 才哲
    才俊 成和 承安 承平 承宣 承允 承泽 承志 飞虎 飞龙 飞羽 涵煦 昊苍 昊空 昊然
    宏达 宏恺 景辉 景明 景山 乐池 天逸 伟志 文宣 文彦 向晨 向阳 星阑 阳波 逸仙
    逸明 正奇 子瑜 玮涛 庭霖 弘智 品川 钰宸 子尘 润楚 元云 杰弘 杰棠 智语 绍若
    贤权 禹哲 纪德 轩军 楠佑 鸿华 峻莱 裕韬 寒淮 烨若 畅孝 雨泰 庆韬 浩慕 恩晨
    佑晨 翰俊 聪铭 瑜睿 应泰 为城 炫杰 竟锋 亦韵 若杰 航苏 俊建 玮锋 晔苏 桦君
    信煊 益正 惠坪 炳城 川健 煊博 瀚强 亦健 卓逸 仲智 旭柳 易扬 浩淼 若星 书润
    圣霖 濡温 生朋 永润 温泰 言佑 乐凡 均语 卓锦 炜泽 奕辰 韵熙 汇润 润庭 伟俊
    立圣 东子 轩宏 哲聪 庭苍 亮涛 松清 绍校 立诚 熠彤 哲瀚 煜城 鹤轩 思聪 展鹏
    笑愚 志强 炫明 雪松 思源 智渊 思淼 鹭洋 昊焱 立果 金鑫 语堂 炎彬 昊强 鑫磊
    郜坤 哲羽 意致 瑾靖 易琦 光济 玄奕 骞尧 清嘉 冷睿 永丰 夭锦 辰哲 承颜 习凛
    堇文 鹏云 华茂 永以 澎湃 康伯 玉韬 云霆 雨伯 友健 维峰 沺誉 安陵 君皓 志勇
    茂材 运杰 佳炎 鸿月 加答 涛卓 康顺 凯定 城可 世砚 博良 睿书 泓佳 书鸣 辉鑫
    语智 艺智 思涵 呈岚 天骐 翰睿 哲涛 凯霆 言陌 浩志 勇笠 玮翔 雄浚 祖弘 宏颢
  `),
  femaleNames1: str2arr(`
    丽 书 云 亚 亦 仙 仪 佳 依 倩 兰 冬 冰 包 卓 园 妍 娜 娟 婧
    婷 媛 安 宜 帆 新 彤 心 思 怡 慧 斌 春 晓 晨 晶 柏 格 梅 梓
    梦 楚 楠 欣 洁 涵 燕 爽 玲 珂 珊 琦 琪 琳 瑶 璐 离 秀 红 绮
    美 羽 翠 艳 艾 芳 苏 若 英 茜 莉 莲 莹 菲 萍 蓓 蕊 蕾 薇 诗
    贝 雪 雯 霜 霞 青 静 舒 乐 乔 以 伊 一 七 九 千 真 芙 秋 夏
  `),
  femaleNames2: str2arr(`
    万奕 万姝 丽华 丽娟 丽颖 之云 之寒 之桃 乐巧 乐晗 乐薇 乔仪 书瑶 予希 云毓
    亦攸 亦橙 今安 以兮 以寒 以葵 以蓝 伊依 伊桃 伊湉 伊诺 优游 余芸 佩瑶 佩蓉
    佳念 佳怡 佳琪 佳琳 佳知 佳觅 依婷 依莹 依龄 倚真 倩知 倾清 冉娇 冉清 冰夏
    冰晴 冰蓉 凌波 凝初 凝安 凝雁 初恩 初瑶 初语 北茉 千柔 千羽 半槐 半烟 南嫣
    南星 南柚 南芊 又菡 双芸 可夏 可星 司纯 向妙 向梦 向真 君雨 含卿 含烟 含蓓
    听薇 和佩 唯兮 善蕊 声笙 夏婷 夏蓉 天亦 奕北 奕芊 妍依 妍欣 妙之 妙馨 妤华
    姗梵 姝美 娟丽 娥菲 婉吟 婉婷 婉宁 婉柠 婧媛 婧恬 婧琳 婧芷 婷玉 婷秀 婷颜
    媚鸿 媱雅 子沛 子茗 宁希 宁敏 安冉 安禾 安诺 宛桔 寄影 寄琴 寄翠 寻双 小芳
    小萱 尔毓 山菡 岁穗 希柠 希雅 待晚 待臻 心怡 心歆 忆雪 念一 念慈 念汐 念薇
    怜南 思妤 思怡 思涵 思琪 思璐 思羽 思莞 思菱 思雅 思颖 怡君 怡岚 怡然 恬娣
    恬栖 恬雨 惜灵 惜珞 惜雪 想蓉 意暄 意羡 慕倾 慕唯 慕晴 慧妍 慧娟 慧琳 文婷
    文静 易真 昕怡 昕甜 昕言 星楚 映凝 映嘉 映安 映菡 映萱 春玲 春花 晏乔 晓倩
    晓夏 晓汐 晓燕 晓瑶 晓蓓 晓霜 晚柠 晚棠 晞悦 晴岚 曦薇 曼冬 曼溪 木冉 柳如
    栀萌 桑宁 梅芳 梓欣 梓紫 梦婷 梦淑 梦琳 梦瑶 梦绾 梨珂 楚奈 楚瑶 橙美 欣妍
    欣怡 欣蓉 欣静 歆一 歆瑜 水妍 水瑶 水静 汐梓 沁蓉 沐心 沐颜 泱祺 洛一 洛颜
    涵易 涵菡 涵菱 淑云 淑娟 淑婷 清墨 清媛 清筱 清颜 溪颜 灵凡 灵淼 灵珊 熙柔
    熙瑾 熙萱 燕君 玉兰 玉梅 玉珍 玖鸢 玥冰 玥婷 玥芙 珑琪 琳姿 琳娜 瑜伽 璇知
    璞诗 甜亦 甜晴 皙宁 皙恬 知宛 知潼 知薇 知韦 碧希 碧琴 禾凝 禾婉 禾茉 禾霓
    秋菊 稚京 笑珞 笑龄 筱茵 简心 素琳 紫丝 紫嫣 紫安 紫知 紫茉 紫莎 紫菱 紫萱
    紫蓝 紫霜 绮晴 绮梅 缘珞 美华 美玲 羽莹 翠桃 聪怡 舒淳 舒然 舒言 艳丽 艳红
    艳蕊 艺涵 艺珂 艺馨 芊凛 芊昔 芊澄 芒可 芝恬 芮柒 芮瑶 芳凝 芳华 芳琴 芳睿
    芳菲 芷卉 芷容 芷巧 芷晴 芷若 芷蝶 芸萱 芸霞 苏郁 苏酥 苡沫 若嫣 若琳 若琼
    若菱 茉涵 茜涵 莉娜 莹云 菀柠 菲悦 萌知 落柔 蓉柳 蓉珊 蕉礼 蕊琪 虞兰 西棠
    觅甜 诗云 诗婷 诗施 诗桃 诗淇 诗琪 诗睿 诗钰 语兰 语嫣 语彤 语淑 语琴 语芙
    语蓉 语蕊 语蝶 语雪 谷梓 辰柚 逸恬 郡一 锦惜 锦芊 雅丽 雅彤 雅惠 雅楠 雅琪
    雅静 雨兰 雨桐 雨梅 雨甯 雨莲 雨萱 雪丽 雪卉 雪晴 雪梅 雪瑶 雯婷 雯雅 霞芬
    青曼 青玥 靖柳 静怡 静文 静昀 静笛 静芙 静若 静雅 颖恩 颖菲 香岚 香菱 香萱
    馨雅 鹿绫 黎念 黎思 黛绿 黛颖 龄蓉
  `),
  rareGroups: str2arr(`
    顾清风浦 段紫云瑶 穆听涛岚 罗晓星雪 季冬雪松 赵露石霜 宋春汐风 雷梦醒霜
    霍春柳晓 龚晓阳翔 冷秋浦燕 骆海瑾琴 韩寒梅云 邹晓露月 倪绿墨云 刘池阳燕
    张秋荷风 杨雪晴露 马云山雁 郭海瑞石 吴春燕柳 沙云飞谷 齐雁南石 柴碧霞月
    王月薇花 金晓岚柳 白云翔石 韩寒梅霜
  `),
};

function str2arr(str: string) {
  return str.trim().split(/\s+/);
}

// 调试用的方法们
interface Arr2StrFn {
  (arr: string[], countPerLine: number, tabSize: number): void;
}
export const enco: Arr2StrFn = (arr, countPerLine = 15, tabSize = 4) => {
  const linePrefix = '\n' + ' '.repeat(tabSize);
  console.log(arr.map((s, i) => (i % countPerLine === 0 ? linePrefix : ' ') + s).join(''));
};

interface Str2ArrFn {
  (str: string): string[];
}
export const deco: Str2ArrFn = (str) => {
  const arr = str
    .trim()
    .split(/\s+/)
    .sort((a, b) => a.length - b.length)
    .sort((a, b) => a.localeCompare(b));
  return arr.filter((s, i) => arr.indexOf(s) === i);
};
