enum StoryNames {
  // 入门
  '通向庭院之歌' = '通向庭院之歌',
  '湖之仆从' = '湖之仆从',
  '无尽食欲' = '无尽食欲',
  '雨势未停' = '雨势未停',
  // 短篇
  '只有猫知道的世界' = '只有猫知道的世界',
  '肉骨血养' = '肉骨血养',
  '周而复始' = '周而复始',
  '醒来' = '醒来',
  '大幕山' = '大幕山',
  '风门秘影' = '风门秘影',
  '死光' = '死光',
  '罪孽之人' = '罪孽之人',
  '黄字的研究' = '黄字的研究',
  '死亡铭刻' = '死亡铭刻',
  '灰色残渣' = '灰色残渣',
  '疯狂的艺术' = '疯狂的艺术',
  '爱的孤儿' = '爱的孤儿',
  '复足' = '复足',
  '不息的渴望' = '不息的渴望',
  '不夜城的苍白之颜' = '不夜城的苍白之颜',
  '亲密邂逅' = '亲密邂逅',
  // 中篇
  '黑水溪' = '黑水溪',
  '芝加哥之王' = '芝加哥之王',
  '燃烧的星辰' = '燃烧的星辰',
  '冬雪之下' = '冬雪之下',
  '勿忘我' = '勿忘我',
  '小瓢虫，快回家' = '小瓢虫，快回家',
  '狂气之峰~邪神的山岭' = '狂气之峰~邪神的山岭',
  '狂气之峰~寻梦未知之峰' = '狂气之峰~寻梦未知之峰',
  // 长篇
  '共斗' = '共斗',
  '谢娘娘点化' = '谢娘娘点化',
  '行走在黑暗中的人们的宴会' = '行走在黑暗中的人们的宴会',
  '列宁格勒之影' = '列宁格勒之影',
  '岸上星辰' = '岸上星辰',
  // 战役
  '奈亚拉托提普的面具' = '奈亚拉托提普的面具',
  '东方快车上的恐怖' = '东方快车上的恐怖',
  '阿撒托斯的红眼' = '阿撒托斯的红眼',
  // 特殊规则
  '挖掘死去之神' = '挖掘死去之神',

  // 已下架
  '音乐节与触手之爱' = '音乐节与触手之爱',
  '冷杉下的低语' = '冷杉下的低语',
  '飞越疯人院' = '飞越疯人院',
  '来自群星的杀手' = '来自群星的杀手',
  '海月之下' = '海月之下',
  '女巫的刻印' = '女巫的刻印',
  '比黑更黑' = '比黑更黑',
  '普罗维登斯的阴霾' = '普罗维登斯的阴霾',
  '我的妹妹想让你受点苦' = '我的妹妹想让你受点苦',

  // 其它店铺
  '夏日怪谈' = '夏日怪谈',
}

export default StoryNames;
